// pages/care/care.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    a: 0,
    curTab:0,
    scrollLeft:0,
    num: ['平和质', '气虚质', '阳虚质', '阴虚质', '湿热质', '气郁质', '血瘀质', '痰湿质', '特禀质'],
    text: [{
        a: '应有节制，细粗粮合理搭配，多吃杂粮、蔬菜、瓜果，少食过于油腻和辛辣之物',
        b: '应有规律，不要过度劳累，饭后宜缓行百步',
        c: '适度运动。适当跑步，老年人可适当散步、打太极拳',
        d: 0,
        r: '平和质'
      },
      {
        a: '多食益气健脾食物，黄豆、白扁豆、鸡肉、泥鳅、香菇、大枣、桂圆',
        b: '宜有规律，夏季午睡，注意保暖，不要过于劳作',
        c: '柔缓运动。按摩足三里',
        d: 1,
        r: '气虚质'
      },
      {
        a: '多食牛肉、羊肉、狗肉、鳝鱼、韭菜、辣椒、葱蒜、胡椒。少食黄瓜、柿子、西瓜',
        b: '夏季避免长时间在空调房间。注意足下、背部、下腹部防寒保暖，防止出汗过多',
        c: '舒缓运动。适当慢跑、适当散步、打太极拳，按摩足三里、关元、涌泉。可适当洗桑那、温泉浴',
        d: 1,
        r: '阳虚质'
      },
      {
        a: '多食瘦猪肉、鸭肉、龟、鳖、绿豆、赤小豆、海蜇、芝麻、百合',
        b: '宜有规律，睡前不饮茶、锻炼和游戏。早睡早起，节制房事，戒烟酒',
        c: '中小强度、间断性锻炼，太极拳、气功、锻炼时控制出汗量，不宜桑拿',
        d: 1,
        r: '阴虚质'
      },
      {
        a: '赤小豆、绿豆、空心菜、芹菜、丝瓜、葫芦、冬瓜、藕、少食羊肉、狗肉、韭菜、辣椒',
        b: '宜干燥环境，通风。不要过于劳累，盛夏暑湿较少户外活动',
        c: '大强度、大运动量的锻炼，中长跑、爬山、游泳、球类、武术',
        d: 1,
        r: '湿热质'
      },
      {
        a: '小麦、蒿子杆、黄花菜、萝卜、葱蒜、山楂、金橘、槟榔、玫瑰花',
        b: '安静环境，睡眠规律，睡前避免饮茶、咖啡、可可等',
        c: '增加户外活动，较大量运动锻炼，跑步、登山、游泳、武术',
        d: 1,
        r: '气郁质'
      },
      {
        a: '黑豆、海藻、海带、紫菜、萝卜、金橘、橙、李、山楂、醋、绿茶、木耳',
        b: '宜有规律，早睡早起。不可过于安逸',
        c: '太极拳、各种舞蹈、步行、健身操常按三阴交',
        d: 1,
        r: '血瘀质'
      },
      {
        a: '清淡。多食葱、蒜、海藻、海带、冬瓜、萝卜、芥末',
        b: '宜干燥不宜潮湿。晒太阳。不要过于安逸，贪恋床榻',
        c: '长期坚持运动，散步、慢跑、羽毛球、游泳。丰隆、承山',
        d: 1,
        r: '痰湿质'
      },
      {
        a: '宜清淡、均衡，粗细搭配，荤素合理。少食腥膻发物和含致敏物质的食物',
        b: '通风、清洁。春季花粉较多，减少外出。不养宠物',
        c: '各种体育锻炼，增强体质，注意防寒饱暖。膀胱经',
        d: 1,
        r: '特禀质'
      },
    ]
  },

  swiperChange(e) { //切换
    let {
      current,
      source
    } = e.detail
    console.log(e)
    if (source === 'autoplay' || source === 'touch') {
      this.setData({
        curTab: current,
        scrollLeft: (current - 1) * 60
      })
    }
  },
  tabSelect(e) {
    let {
      id
    } = e.currentTarget.dataset
    this.setData({
      curTab: id,
      scrollLeft: (id - 1) * 60
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  },
  // change:function(e){
  //   var tex=this.data.text,aa=this.data.a
  //   tex[aa].d=1
  //   tex[e.detail.current].d=0
  //   this.setData({text:tex})
  //   this.setData({a:e.detail.current})
  // }
})